#语法格式：
#        模板字符串.format(逗号分隔的参数)
#        槽位用{}表示
"""
a='{}曰：学而时习之，不亦说乎'.format('孔子')
print(a)
b='{}曰：学而时习之，不亦{}'.format('孔子','说乎')
print(b) 
"""

#参数排序
#参数1号位对应{0},二号位对应{1}
""" 
c='{0}曰:学而时习之,不亦{1}'.format('孔子','说乎')
print(c)
d='{1}曰:学而时习之,不亦{0}'.format('说乎','孔子')
print(d)
"""

""" 
e='{0}开{0}落'.format('花')
print(e) 
"""

#format方法的格式控制
#语法格式：
#        {参数序号:格式控制标记}

#设置宽度，0是序号，25是指定宽度
#实际宽度4<指定宽度25，用指定宽度
#默认左对齐方式
""" e='{0:25}'.format('等级考试')
print(e) """

#<左对齐
#>右对齐
#^居中对齐
""" g='{0:^25}'.format('等级考试')
print(g) """

""" g='{0:>25}'.format('等级考试')
print(g) """

#填充空格处
""" h='{0:/^25}'.format('等级考试')
print(h) """

#指定宽度小于实际宽度,按照实际宽度
""" 
i='{0:*^1}'.format('等级考试')
print(i) 
"""


"""用于对数值本身的规范：，、.精度、类型。"""
'''①逗号(,)：用于显示数字类型的千位分隔符。'''
""" 
j='{:-^25,}'.format(1234567890)
print(j) 
"""
#结果：------1,234,567,890------

'''
②.精度：有小数点(.)开头，对于浮点数，精度表示小
数部分输出的有效位数，对于字符串，精度表示输出的
最大长度。如果小数点保留长度超过应输出的长度，以
应输出长度为准。
'''
""" 
k='{0:.2f}'.format(123.456789)
print(k) 
"""
#结果：123.46

""" 
z='{0:->25.3f}'.format(123.456789)
print(z)
#结果：------------------123.457
l='{0:->25,.3f}'.format(123456.789)
print(l)
#结果--------------123,456.789
"""

#字符串型
""" m='{0:.3}'.format('计算机等级考试')
print(m) """
#结果：计算机
""" 
n='{0:.25}'.format('计算机等级考试')
print(n) 
"""
#结果：计算机等级考试

'''
③类型
'''
"""整数类型输出格式"""
#b:输出整数的二进制
#c:输出整数的Unicode字符
#d:输出整数的十进制
#o:输出整数的八进制
#x:输出整数的小写十六进制
#X:输出整数的大写十六进制
""" 
o='{0:b},{0:c},{0:d},{0:o},{0:x},{0:X}'.format(120)
print(o) 
"""
#结果：1111000,x,120,170,78,78
""" 
o='{0:b},{0:c},{0:d},{0:o},{0:x},{0:X}'.format(425)
print(o) 
""" 
#结果：110101001,Ʃ,425,651,1a9,1A9

"""浮点数类型输出格式"""
#e:输出浮点数对应的小写字母e的指数形式
#E:输出浮点数对应的大写字母E的指数形式
#f:输出浮点数对应的标准浮点形式
#%:输出浮点数对应的百分比形式
""" 
p='{0:e},{0:E},{0:f},{0:%}'.format(3.14)
print(p) 
"""
#结果：3.140000e+00,3.140000E+00,3.140000,314.000000%
'''
2位精度:
'''
p='{0:.2e},{0:.2E},{0:.2f},{0:.2%}'.format(3.14)
print(p)
#结果：3.14e+00,3.14E+00,3.14,314.00%